БухЭксп/Catalogs/CW_УсловияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_УсловияОплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокРасчетаДляУсловияОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаОтсрочки</Name>
					<Comment>0 - Календарные дни; 1 - рабочие дни</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПереносаДаты</Name>
					<Comment>0 - не переносить;1- на следующий рабочий день; 2 -на предыдущий рабочий день</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокРасчетаДляУсловияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокРасчетаДляУсловияОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыПолученияПередачиСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыВозвратаАкта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_УсловияОплаты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	УправлениеФормой();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ПодключаемаяОбработка =  Объект.ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ПодключаемаяОбработка");
	
	Элементы.ПодключаемаяОбработка.Видимость		= ПодключаемаяОбработка;
	Элементы.ГруппаСпособРасчета.Видимость 			= НЕ ПодключаемаяОбработка;
	
	//Элементы.ПорядокРасчета.Доступность 		= Не Объект.Предопределенный;
	//Элементы.ГруппаСпособРасчета.Доступность 	= Не Объект.Предопределенный;
	
	Элементы.ПроизводственныйКалендарь.Видимость 	= Объект.СпособРасчетаОтсрочки = 1 
													ИЛИ (Объект.СпособРасчетаОтсрочки = 0 и Объект.ВариантПереносаДаты > 0)
													И НЕ ПодключаемаяОбработка;
													
	Элементы.ВариантПереносаДаты.Видимость 			= Объект.СпособРасчетаОтсрочки = 0 и НЕ ПодключаемаяОбработка;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокРасчетаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры


&НаСервере
Процедура СпособРасчетаОтсрочкиПриИзмененииНаСервере()
	
	Элементы.ПроизводственныйКалендарь.Видимость 	= Объект.СпособРасчетаОтсрочки = 1 
													ИЛИ (Объект.СпособРасчетаОтсрочки = 0 и Объект.ВариантПереносаДаты > 0);
													
	Элементы.ВариантПереносаДаты.Видимость 			= Объект.СпособРасчетаОтсрочки = 0;
	
	Если Объект.СпособРасчетаОтсрочки = 1 Тогда
		Объект.ВариантПереносаДаты = 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПроизводственныйКалендарь) Тогда
		Если Не Константы.ИспользоватьНесколькоПроизводственныхКалендарей.Получить() Тогда
			Объект.ПроизводственныйКалендарь = ПолучитьЕдинственныйКалендарь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕдинственныйКалендарь()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПроизводственныеКалендари.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СпособРасчетаОтсрочкиПриИзменении(Элемент)
	СпособРасчетаОтсрочкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПереносаДатыПриИзменении(Элемент)
	
	Элементы.ПроизводственныйКалендарь.Видимость = Объект.СпособРасчетаОтсрочки = 1 
												ИЛИ (Объект.СпособРасчетаОтсрочки = 0 и Объект.ВариантПереносаДаты > 0);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Объект.ПорядокРасчета <> ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ПодключаемаяОбработка")
		И Объект.СпособРасчетаОтсрочки = 1 
		И Не ЗначениеЗаполнено(Объект.ПроизводственныйКалендарь) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен производственный календарь",,"ПроизводственныйКалендарь", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
